#######################################################
# 当コマンド集は
# build-postgres-on-ebs.shの手順に従って作成されたEBSを使って
# PostgreSQLのデータを復旧する手順です.
# スナップショットから作ったEBSボリュームに対しても
# 同じ手順で復旧可能です.
# 前提）
# ・build-postgres-on-ebs.shの手順に従って作成された
#   EBSボリュームが/dev/xvdfにアタッチされている.
# 注意）
# このファイルの拡張子はshですが
# ところどころ対話形式になる箇所があり、
# そのままは実行出来ません.
# １行ずつ実行することを推奨します.
#######################################################

#######################################################
# OSの最新化
#######################################################
sudo yum -y update

#######################################################
# PostgreSQLのデータディレクトリにEBSをマウントする.
# ※EC2とEBSのAZはそろえておく必要がある.
#######################################################
# デフォルトのPostgreSQLのデータディレクトリにEBSをマウントする
# デバイス名は適宜変更すること
sudo mkdir /var/lib/pgsql93/
sudo mount /dev/xvdf /var/lib/pgsql93

#######################################################
# PostgreSQLのインストール
#######################################################
sudo rpm -i http://yum.postgresql.org/9.3/redhat/rhel-6-x86_64/pgdg-redhat93-9.3-1.noarch.rpm
sudo yum -y install postgresql93-server postgresql93-contrib

#######################################################
# postgresユーザのパスワードを設定する.
# これをしないとsuコマンドでのログインが出来ない.
#######################################################
sudo passwd postgres

#######################################################
# PostgreSQLを再起動.
#######################################################
sudo chkconfig postgresql93 on
sudo service postgresql93 restart

#######################################################
# 動作確認
#######################################################
psql -U app -h localhost
\l

(以下のように表示されればOK)

                                         データベース一覧
   名前    |  所有者  | エンコーディング |  照合順序   | Ctype(変換演算子) |      アクセス権       
-----------+----------+------------------+-------------+-------------------+-----------------------
 app       | app      | UTF8             | ja_JP.UTF-8 | ja_JP.UTF-8       | 
 postgres  | postgres | UTF8             | ja_JP.UTF-8 | ja_JP.UTF-8       | 
 template0 | postgres | UTF8             | ja_JP.UTF-8 | ja_JP.UTF-8       | =c/postgres          +
           |          |                  |             |                   | postgres=CTc/postgres
 template1 | postgres | UTF8             | ja_JP.UTF-8 | ja_JP.UTF-8       | =c/postgres          +
           |          |                  |             |                   | postgres=CTc/postgres
(4 行)


